/* Παράδειγμα προγράμματος σε C
 *
 * Για μεταγλώττιση σε Ubuntu:
 *  - ο μεταγλωττιστής είναι προεγκατεστημένος
 *  - αν δεν είναι προεγκατεστημένος, εγκατάσταση με
 *      sudo apt install build-essential
 *  - εντολή μεταγλώττισης:
 *      gcc paradeigma.c -o paradeigma_c
 *
 * Για εκτέλεση του προγράμματος:
 *    ./paradeigma_c
 *
 * Αποτέλεσμα:
 *  Γεια σου, κόσμε!
 *  Εκτέλεση if: Αληθές και όχι ψευδές!
 *  Εκτέλεση βρόγχου: 0 1 2 3 4 5 6 7 8 9
 *  Αυτή είναι μια υπορουτίνα με αριθμό 5.
 */

#include <stdio.h>


int subroutine(int number)
{
   printf("Αυτή είναι μια υπορουτίνα με αριθμό %d.\n", number);

   return 0;
}

int main() {
    int i;

    printf("Γεια σου, κόσμε!\n");

    if (1)
        printf("Εκτέλεση if: Αληθές και όχι ψευδές!\n");

    printf("Εκτέλεση βρόγχου: ");
    for (i = 0; i < 10; i++)
    {
        printf("%d ", i);
    }
    printf("\n");

    subroutine(5);

    return 0;
}
