#!/bin/bash
: '
 * Παράδειγμα προγράμματος σε Bash
 *
 * Για εκτέλεση σε Ubuntu:
 *  - ο μεταφραστής του Bash είναι προεγκατεστημένος
 *
 * Για εκτέλεση του προγράμματος:
 *    bash paradeigma.sh
 *
 * Αποτέλεσμα:
 *  Γεια σου, κόσμε!
 *  Εκτέλεση if: Αληθές και όχι ψευδές!
 *  Εκτέλεση βρόγχου: 0 1 2 3 4 5 6 7 8 9
 *  Αυτή είναι μια υπορουτίνα με αριθμό 5.
'

function subroutine {
   number=$1;
   echo "Αυτή είναι μια υπορουτίνα με αριθμό $number."

   return 0;
}

echo "Γεια σου, κόσμε!";

if [[ 1 ]]; then
    echo "Εκτέλεση if: Αληθές και όχι ψευδές!"
fi

echo -n "Εκτέλεση βρόγχου: ";
for i in `seq 0 9`
do
    echo -n "$i "
done
echo;

subroutine 5

exit 0;
